In [23]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import statsmodels.api as sm
from scipy.stats import pearsonr, spearmanr
%matplotlib inline
df = pd.read_csv('alpha24_step15Stud.csv')
df['temp'] = df['temp'].apply(lambda x: x.replace(',','.')).astype('float64')
df['Ts'] = df['Ts'].apply(lambda x: x.replace(',','.')).astype('float64')

In [24]:
df.head()

   czas(min)  alpha  temp    Ts
0          0      1  6.50  2.00
1         15      0  6.35  2.18
2         30      0  6.20  2.19
3         45      1  6.05  1.68
4         60      1  5.90  1.50

In [25]:
del df['czas(min)']
df['Ts+1'] = df['Ts'].shift(-1)

In [26]:
df.head()

   alpha  temp    Ts  Ts+1
0      1  6.50  2.00  2.18
1      0  6.35  2.18  2.19
2      0  6.20  2.19  1.68
3      1  6.05  1.68  1.50
4      1  5.90  1.50  1.64

In [27]:
df['Ts'].describe()

count    2976.000000
mean       -0.840649
std         1.336870
min        -3.150000
25%        -1.940000
50%        -1.055000
75%         0.160000
max         3.910000
Name: Ts, dtype: float64

In [28]:
df['temp'].describe()

count    2976.000000
mean        6.155931
std         3.733827
min        -2.000000
25%         3.600000
50%         5.430000
75%         8.270000
max        20.300000
Name: temp, dtype: float64

In [29]:
df['tscopy'] = df['Ts']

In [30]:
df.head()

   alpha  temp    Ts  Ts+1  tscopy
0      1  6.50  2.00  2.18    2.00
1      0  6.35  2.18  2.19    2.18
2      0  6.20  2.19  1.68    2.19
3      1  6.05  1.68  1.50    1.68
4      1  5.90  1.50  1.64    1.50

In [31]:
df.head()

   alpha  temp    Ts  Ts+1  tscopy
0      1  6.50  2.00  2.18    2.00
1      0  6.35  2.18  2.19    2.18
2      0  6.20  2.19  1.68    2.19
3      1  6.05  1.68  1.50    1.68
4      1  5.90  1.50  1.64    1.50

In [32]:
df.tail()

      alpha   temp    Ts  Ts+1  tscopy
2971      0  11.75  2.90  2.96    2.90
2972      0  11.50  2.96  2.78    2.96
2973      1  11.27  2.78  2.72    2.78
2974      1  11.04  2.72  2.56    2.72
2975      1  10.81  2.56   NaN    2.56

In [33]:
df[:-3].tail()

      alpha   temp    Ts  Ts+1  tscopy
2968      1  12.50  2.78  2.95    2.78
2969      0  12.25  2.95  2.83    2.95
2970      1  12.00  2.83  2.90    2.83
2971      0  11.75  2.90  2.96    2.90
2972      0  11.50  2.96  2.78    2.96